Revit 2024 API
BuiltInFailures.StairRampFailures.CannotPlaceRailingOnStringerWarning Property
 Railing is placed on tread because there is no stringer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlaceRailingOnStringerWarning { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlaceRailingOnStringerWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlaceRailingOnStringerWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace